{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/612ccc98-879c-40bb-8ae1-717543846ea2')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/612ccc98-879c-40bb-8ae1-717543846ea2')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2021-10-01-preview",
            "properties": {
                "displayName": "RDP Attempts During Off Hours",
                "description": "",
                "severity": "Medium",
                "enabled": true,
                "query": "// RDP Attempts During Off Hours\nDeviceNetworkEvents\n| where LocalPort == 3389 and ActionType == \"InboundConnectionAccepted\"\n| extend TimeBin = bin(TimeGenerated, 2s)\n| project-away DeviceId\n| join kind=leftouter (DeviceNetworkEvents\n| where RemotePort == 3389\n| project-away DeviceId\n| extend TimeBin = bin(TimeGenerated, 2s)\n) on TimeBin\n| where RemoteIP == LocalIP1\n| where InitiatingProcessFileName1 !=\"Microsoft.Tri.Sensor.exe\" and RemoteIP1 != \"127.0.0.1\" and RemoteIP1 !=\"::1\" and InitiatingProcessCommandLine1 !contains \"UnicastScanner\"\n| extend ClientInitProcessID = InitiatingProcessId1\n| project-away InitiatingProcessId1\n| extend Hour = hourofday(TimeGenerated -5h) // UTC TIME - 5h to match Eatern Time\n| where Hour < 7 or Hour > 19 // HOURS Between 7 pm to 6 am\n| where LocalIP1 !in~ (\"170.24.103.116\",\"10.200.0.6\",\"170.24.103.115\",\"170.24.103.110\")\n| where RemoteIP !in~ (\"170.24.103.116\",\"10.200.0.6\",\"170.24.103.115\",\"170.24.103.110\",\"170.24.100.3\",\"170.24.100.4\")\n",
                "queryFrequency": "PT1H",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "tactics": [
                    "LateralMovement"
                ],
                "techniques": [
                    "T1021"
                ],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "LocalIP1"
                            }
                        ]
                    },
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "LocalIP"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "HostName",
                                "columnName": "DeviceName"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "HostName",
                                "columnName": "DeviceName1"
                            }
                        ]
                    },
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "InitiatingProcessAccountUpn"
                            }
                        ]
                    }
                ]
            }
        }
    ]
}